In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: numpy>=1.22.4 in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: six>=1.5 in c:\users\sharath r\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

WARNING: You are using pip version 21.1.1; however, version 24.3.1 is available.
You should consider upgrading via the 'c:\users\sharath r\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

In [2]:
#1 working with pandas
#a) Creating series:-Collection of data in one dimensions

In [1]:
import pandas as pd
import numpy as np

__Table of Contents__


1. Working with Pandas Series
----- a) Creating Series
 
 Series through list
 
 Series through Numpy Array
 
 Setting up our own index
 
 Series through dictionary
 
 Using repeat function along with creating a Series
 
 Accessing data from Series
----- b) Aggregate function on Pandas Series
----- c) Sereis Absolute Function
----- d) Appending Series
----- e) Astype Function
----- f) Between Functions
----- g) All strings functions can be used to extract or modify texts in a series
 
 Upper and Lower Function
 
 Len function
 
 Strip Function
 
 Split Function
 
 Contains Function
 
 Replace Function
 
 Count Function
 
 Startswith and Endswith Function
 
 Find Finction
----- h) Converting a Series to List

2. Detailed Coding Implementations on Pandas DataFrame
-----a) Creating Data Frames
-----b) Slicing in DataFrames Using Iloc and Loc
 
 Basic Loc Operations
 
 Basic Iloc Operations
 
 Slicing Using Conditions
-----c) Column Addition in DataFrames
 
 Using List
 
 Using Pandas Seires
 
 Using an Existing Column
-----d) Deleting Column in DataFrame
 
 Using del
 
 Using pop function
----- e) Addition of rows
----- f) Drop function
----- g) Transposing a DataFrame
----- h) A set of more DataFrame Functionalities
 
 axes function
 
 ndim function
 
 dtypes function
 
 shape function
 
 head function
 
 tail function
 
 empty function
----- i) Statistical or Mathematical Functions
 
 Sum
 
 Mean
 
 Median
 
 Mode
 
 Variance
 
 Min
 
 Max
 
 Standard Deviation
----- j) Describe Function
----- k) Pipe Functions:
 
 Pipe function
 
 Apply Function
 
 Applymap Function
----- l) Reindex Function
----- m) Renaming Columns in Pandas DataFrame
----- n) Sorting in Pandas DataFrame
----- o) Groupby Functions
 
 Adding Statistical Computation on groupby
 
 Using Filter Function with Groupby

3. Working with csv files and basic data Analysis Using Pandas

-----a) Reading CSV
-----b) Info Function
-----c) isnull() Function
-----d) Quantile Function
-----e) Copy Function
-----f) Value Counts Function
-----g) Unique and Nunique functopn
-----h) dropna() function
-----i) fillna() fucntion
-----j) sample Functions
-----k) to_csv() functions

4. A detailed Pandas Profile Report

In [4]:
#series through list

In [5]:
list=[1,2,3,4,5]
list

[1, 2, 3, 4, 5]

In [6]:
pd.Series(list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

`np.array()`

In [7]:
#series through numpy array

In [8]:
arr=np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [9]:
pd.Series(data=["sharath","chatra","pooja"],index=[1,2,3])

1    sharath
2     chatra
3      pooja
dtype: object

In [10]:
pd.Series(index=["sharath","chaitra","pooja"],data=[1,2,3])

sharath    1
chaitra    2
pooja      3
dtype: int64

In [11]:
#series through dictionary

In [12]:
steps={'day_1':4000,'day_2':3000,'day_3':12000}
pd.Series(steps)

day_1     4000
day_2     3000
day_3    12000
dtype: int64

In [13]:
#Along with repeate function

In [14]:
pd.Series(5).repeat(5)

0    5
0    5
0    5
0    5
0    5
dtype: int64

In [17]:
pd.Series(5).repeat(3).reset_index(drop=True)

0    5
1    5
2    5
dtype: int64

In [18]:
s=pd.Series([10,200]).repeat([5,2]).reset_index(drop=True)

In [37]:
#Access The element

In [42]:
s[0]

10

In [43]:
s[::]

0     10
1     10
2     10
3     10
4     10
5    200
6    200
dtype: int64

In [44]:
s[2:4]

2    10
3    10
dtype: int64

In [45]:
s[1:-1]

1     10
2     10
3     10
4     10
5    200
dtype: int64

# b) Aggrigate Function

In [46]:
s=pd.Series([1,2,3,4,5,6,7])
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [47]:
s.agg([min,max,sum])

C:\Users\sharath R\AppData\Local\Temp\ipykernel_40368\1839022704.py:1: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  s.agg([min,max,sum])
C:\Users\sharath R\AppData\Local\Temp\ipykernel_40368\1839022704.py:1: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  s.agg([min,max,sum])
C:\Users\sharath R\AppData\Local\Temp\ipykernel_40368\1839022704.py:1: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  s.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

In [48]:
s.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [21]:
sr=pd.Series([1,-2,3,-4,-5])
sr

0    1
1   -2
2    3
3   -4
4   -5
dtype: int64

In [22]:
sr.abs()

0    1
1    2
2    3
3    4
4    5
dtype: int64

d) APPENDING SERIES

Pandas series.append()function is used to concatenate two ormore series object.

In [35]:
sr1=pd.Series([1,-2,3,-4,5,-6,7])
sr2=pd.Series([4,5,6,7,8,9])
sr3=pd.concat([sr1,sr2])
sr3

0    1
1   -2
2    3
3   -4
4    5
5   -6
6    7
0    4
1    5
2    6
3    7
4    8
5    9
dtype: int64

In [25]:
list1=[1,2,3]
list2=[4,5,6]
list3=list1.append(list2)

In [27]:
print(list3)

None

e) ASTYPE() FUNCTION

ASTYPE() FUNCTION IS A IMPORTANT METHOD TO USED THE CHANGE THE DATATYPE IN GIVEN SERIES

In [36]:
sr1

0    1
1   -2
2    3
3   -4
4    5
5   -6
6    7
dtype: int64

In [37]:
type(sr1)

pandas.core.series.Series

In [38]:
sr2

0    4
1    5
2    6
3    7
4    8
5    9
dtype: int64

In [39]:
sr2.astype('float')

0    4.0
1    5.0
2    6.0
3    7.0
4    8.0
5    9.0
dtype: float64

f) BETWEEN FUNCTION

Pandas bewteeen()method is used on series to check which values lie between first and second argument.

In [40]:
sr1=pd.Series([1,2,3,4,5,6,7,8,9])
sr1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [41]:
sr1.between(5,7)

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7    False
8    False
dtype: bool

In [42]:
sr1.between(10,17)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

g)All STRINGS FUNCTION CAN BE USED TO EXTRACT OR MODIFY TEXTS IN A SERIES

UPPERCASE LOWER CASE,
LEN FUNCTION,
STRIP FUNCTION,
SPLIT FUNCTION,
CONTAIKNS FUNCTION,
REPLACE FUNCTION,
COUNT FUNCTION,
STARTSWITH AND ENDSWITH FUNCTION,
FIND FUNCTION,

In [4]:
ser=pd.Series(["  Data Science","python","Geeks for Geeks","Helloword"])

In [6]:
print(ser.str.upper())

0       DATA SCIENCE
1             PYTHON
2    GEEKS FOR GEEKS
3          HELLOWORD
dtype: object

In [7]:
print(ser.str.lower())

0       data science
1             python
2    geeks for geeks
3          helloword
dtype: object

Length function

In [9]:
for i in ser:
    print(i,len(i))

Data Science 12
python 6
Geeks for Geeks 15
Helloword 9

Strip Function

In [10]:
ser=ser.str.strip()

In [13]:
for i in ser:
    print(i,len(i))

Data Science 12
python 6
Geeks for Geeks 15
Helloword 9

split function

In [23]:
ser=ser.str.split()

AttributeError: 'numpy.float64' object has no attribute 'str'

In [24]:
ser

nan

In [25]:
ser=ser.str.split()

AttributeError: 'numpy.float64' object has no attribute 'str'

In [26]:
ser

nan

CONTAINS

In [27]:
SERIES=pd.Series(['Sharath','@bharathh','@Adarsh','Govind'])
SERIES

0      Sharath
1    @bharathh
2      @Adarsh
3       Govind
dtype: object

In [30]:
ser=SERIES.str.contains('@')

In [31]:
ser

0    False
1     True
2     True
3    False
dtype: bool

Replace

In [35]:
ser=SERIES.str.replace('@','')

In [33]:
ser

0    False
1     True
2     True
3    False
dtype: bool

Count Function

In [41]:
ser=SERIES.str.count('S')

In [42]:
ser

0    1
1    0
2    0
3    0
dtype: int64

Startwith ends with

In [46]:
ser=SERIES.str.startswith('S')

In [47]:
ser

0     True
1    False
2    False
3    False
dtype: bool

In [48]:
ser=SERIES.str.endswith('S')

In [49]:
ser

0    False
1    False
2    False
3    False
dtype: bool

Find function

In [51]:
Series=pd.Series(['Sharath','@bharathh','@Adarsh','Govind'])
ser=Series.str.find('sharath')

In [52]:
ser

0   -1
1   -1
2   -1
3   -1
dtype: int64

h)Converting series into a list

In [53]:
ser.to_list()

[-1, -1, -1, -1]

2)Detailed coding implementation of pandas DataFrame

Pandas dataframe defined as the two dimension of dataframe size is mutable

In [54]:
#Creating a datframe using list

In [55]:
list=['sharath','is','a','good','boy']
li=pd.DataFrame(list)

In [56]:
li

         0
0  sharath
1       is
2        a
3     good
4      boy

A Dataframe is a two dimensional data structure i.e data is align in a tabular fasion in rows and columns.We can perfoem basic operations on rows /columns like selecting,deleting ,adding and renaming

In [4]:
data={'name'     :['jal','princi','gaurav','anju'],
      'age'      :[24,25,27,28],
      'qualification':['BE','MSC','BCOM','MCA']
     }
df=pd.DataFrame(data)
df[['name','qualification']]

     name qualification
0     jal            BE
1  princi           MSC
2  gaurav          BCOM
3    anju           MCA

b)__Slicing in dataframes using Iloc and loc__

Pandas comprises many methods for its proper functioning. loc() and iloc() are one of those methods. These are used in slicing data from the Pandas DataFrame. They help in the convenient selection of data from the DataFrame in Python. They are used in filtering the data according to some conditions

In [7]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

Basic loc operation

Python loc() function The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. This method includes the last element of the range passed in it, unlike iloc(). loc() can accept the boolean data unlike iloc(). Many operations can be performed using the loc() method like

In [8]:
df.loc[1]

one         2
two        20
three     200
four     2000
Name: 1, dtype: int64

In [10]:
df.loc[1:2,'two' : 'three']

   two  three
1   20    200
2   30    300

__BASIC ILOC OPERATION__

The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it unlike loc(). iloc() does not accept the boolean data unlike loc().

In [11]:
df.iloc[1:2]

   one  two  three  four
1    2   20    200  2000

In [12]:
df.iloc[::]

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [14]:
df.iloc[:3,:]

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000

In [15]:
df.iloc[1:-1,1:-1]

   two  three
1   20    200
2   30    300

In [17]:
df.iloc[:,2:3]

   three
0    100
1    200
2    300
3    400

In [18]:
#selcting specific row

In [19]:
df.iloc[[0,2],[1,3]]

   two  four
0   10  1000
2   30  3000

In [20]:
#by using comma(,)instead of colum we can extract specific data foe which index we have passed

__c)Slicing Using Condition__

In [24]:
df.loc[df['two']>20,['three','four']]

   three  four
2    300  3000
3    400  4000

In [27]:
df.loc[df['three']<300,['one','four']]

   one  four
0    1  1000
1    2  2000

__Coloumn Adittion in the dataframe__

In [28]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [29]:
#in adding coloumn we need to use list or series for example given below

In [30]:
l=[22,23,24,25]
df['five']=l
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    23
2    3   30    300  3000    24
3    4   40    400  4000    25

In [33]:
sr=pd.Series([100,200,300,400])
df['six']=sr
df

   one  two  three  four  five  six
0    1   10    100  1000    22  100
1    2   20    200  2000    23  200
2    3   30    300  3000    24  300
3    4   40    400  4000    25  400

In [35]:
df['seven']=df['one']+10
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  100     11
1    2   20    200  2000    23  200     12
2    3   30    300  3000    24  300     13
3    4   40    400  4000    25  400     14

__Column Deletion in a dataframe__


We can use del , pop and drop method to delete the column

In [36]:
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  100     11
1    2   20    200  2000    23  200     12
2    3   30    300  3000    24  300     13
3    4   40    400  4000    25  400     14

In [38]:
del df['six']

In [39]:
df

   one  two  three  four  five  seven
0    1   10    100  1000    22     11
1    2   20    200  2000    23     12
2    3   30    300  3000    24     13
3    4   40    400  4000    25     14

In [40]:
df.pop('seven')

0    11
1    12
2    13
3    14
Name: seven, dtype: int64

In [41]:
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    23
2    3   30    300  3000    24
3    4   40    400  4000    25

__e) Addition Of Rows__

In a Pandas DataFrame, you can add rows by using the append method. You can also create a new DataFrame with the desired row values and use the append to add the new row to the original dataframe. Here's an example of adding a single row to a dataframe:

In [59]:
df1=pd.DataFrame([[1,2],[3.4]],columns=['a','b'])
df2=pd.DataFrame([[5,6],[7.8]],columns=['c','d'])

df1

     a    b
0  1.0  2.0
1  3.4  NaN

__f) Pandas drop function__

Python is a great language for doing data analysis, primarily because of the fantastic ecosystem of data-centric Python packages. Pandas is one of those packages and makes importing and analyzing data much easier.

Pandas provide data analysts a way to delete and filter data frame using .drop() method. Rows or columns can be removed using index label or column name using this method.

Syntax: DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors=’raise’)

Parameters:

labels: String or list of strings referring row or column name. axis: int or string value, 0 ‘index’ for Rows and 1 ‘columns’ for Columns. index or columns: Single label or list. index or columns are an alternative to axis and cannot be used together. level: Used to specify level in case data frame is having multiple level index. inplace: Makes changes in original Data Frame if True. errors: Ignores error if any value from the list doesn’t exists and drops rest of the values when errors = ‘ignore’

Return type: Dataframe with dropped values

In [61]:
data={'one':[10,20,30,40],
      'two':[100,200,300,400],
      'three':[1000,2000,3000,4000],
      'four':[10000,20000,30000,40000]}
df=pd.DataFrame(data)
df

   one  two  three   four
0   10  100   1000  10000
1   20  200   2000  20000
2   30  300   3000  30000
3   40  400   4000  40000

In [64]:
df.drop([0,1],axis=0,inplace=True)

In [65]:
df

   one  two  three   four
2   30  300   3000  30000
3   40  400   4000  40000

In [66]:
#axis=0 is a row wise
#axis=1 column wise

In [67]:
df.drop(['one','three'],axis=1,inplace=True)

In [68]:
df

   two   four
2  300  30000
3  400  40000

__g) Transposing a DataFrame__

The .T attribute in a Pandas DataFrame is used to transpose the dataframe, i.e., to flip the rows and columns. The result of transposing a dataframe is a new dataframe with the original rows as columns and the original columns as rows.

Here's an example to illustrate the use of the .T attribute:

In [69]:
#the transpose matrix defined as rows become columns and columns become rows

In [70]:
data={'one':[10,20,30,40],
      'two':[100,200,300,400],
      'three':[1000,2000,3000,4000],
      'four':[10000,20000,30000,40000]}
df=pd.DataFrame(data)
df

   one  two  three   four
0   10  100   1000  10000
1   20  200   2000  20000
2   30  300   3000  30000
3   40  400   4000  40000

In [71]:
df.T

           0      1      2      3
one       10     20     30     40
two      100    200    300    400
three   1000   2000   3000   4000
four   10000  20000  30000  40000

__h) A set of more DataFrame Functionalities__

In [72]:
df

   one  two  three   four
0   10  100   1000  10000
1   20  200   2000  20000
2   30  300   3000  30000
3   40  400   4000  40000

1.axes function

The .axes attribute in a Pandas DataFrame returns a list with the row and column labels of the DataFrame. The first element of the list is the row labels (index), and the second element is the column labels.

In [73]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

2.ndim function

The .ndim attribute in a Pandas DataFrame returns the number of dimensions of the dataframe, which is always 2 for a DataFrame (row-and-column format).

In [74]:
df.ndim

2

3.dtypes

The .dtypes attribute in a Pandas DataFrame returns the data types of the columns in the DataFrame. The result is a Series with the column names as index and the data types of the columns as values.

In [75]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

4.shape function

The .shape attribute in a Pandas DataFrame returns the dimensions (number of rows, number of columns) of the DataFrame as a tuple.

In [76]:
df.shape

(4, 4)

5.empty function()

The .empty attribute in a Pandas DataFrame returns a Boolean value indicating whether the DataFrame is empty or not. A DataFrame is considered empty if it has no rows.

In [79]:
df=pd.DataFrame()
df.empty

True

__i) Statistical or Mathematical Functions__


Sum 
 
 Mean 
 
 Median 
 
 Mode 
 
 Variance 
 
 Min 
 
 Max 
 
 Standard Deviation

In [80]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [81]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [82]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [83]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [85]:
de = pd.DataFrame({'A': [1, 2, 2, 3, 4, 4, 4, 5], 'B': [10, 20, 20, 30, 40, 40, 50, 60]})

print('A',de['A'].mode())
print('B',de['B'].mode())

A 0    4
Name: A, dtype: int64
B 0    20
1    40
Name: B, dtype: int64

In [87]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [88]:
df.max()

one         4
two        40
three     400
four     4000
dtype: int64

In [89]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

In [90]:
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

j) Describe Function

The describe() method in a Pandas DataFrame returns descriptive statistics of the data in the DataFrame. It provides a quick summary of the central tendency, dispersion, and shape of the distribution of a set of numerical data.

The default behavior of describe() is to compute descriptive statistics for all numerical columns in the DataFrame. If you want to compute descriptive statistics for a specific column, you can pass the name of the column as an argument.

In [91]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000]),
        'five' : pd.Series(['A','B','C','D'])}


df = pd.DataFrame(data)

df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

k) Pipe Functions


The pipe() method in a Pandas DataFrame allows you to apply a function to the DataFrame, similar to the way the apply() method works. The difference is that pipe() allows you to chain multiple operations together by passing the output of one function to the input of the next function.

In [92]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [93]:
def add(i,j):
    return i+j
def sub(i,j):
    return i-j

In [95]:
df.pipe(add,10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [96]:
df.pipe(sub,10)

   one  two  three  four
0   -9    0     90   990
1   -8   10    190  1990
2   -7   20    290  2990
3   -6   30    390  3990

In [97]:
def mean(col):
    return col.mean()
def square(i):
    return i**2

In [98]:
df.pipe(mean)

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [99]:
df.pipe(square)

   one   two   three      four
0    1   100   10000   1000000
1    4   400   40000   4000000
2    9   900   90000   9000000
3   16  1600  160000  16000000


2. Apply Function


The apply() method in a Pandas DataFrame allows you to apply a function to the DataFrame, either to individual elements or to the entire DataFrame. The function can be either a built-in Python function or a user-defined function.

In [100]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

print(df.apply(np.mean))

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [101]:
df.apply(lambda x:x.max()-x.min())

one         3
two        30
three     300
four     3000
dtype: int64

3) Apply MAp function

The map() method in a Pandas DataFrame allows you to apply a function to each element of a specific column of the DataFrame. The function can be either a built-in Python function or a user-defined function.

In [103]:
df.applymap(lambda x:x*100)

C:\Users\sharath R\AppData\Local\Temp\ipykernel_25788\1004646656.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x:x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

applymap and apply are both functions in the pandas library used for applying a function to elements of a pandas DataFrame or Series.

applymap is used to apply a function to every element of a DataFrame. It returns a new DataFrame where each element has been modified by the input function.

apply is used to apply a function along any axis of a DataFrame or Series. It returns either a Series or a DataFrame, depending on the axis along which the function is applied and the return value of the function. Unlike applymap, apply can take into account the context of the data, such as the row or column label.

So, applymap is meant for element-wise operations while apply can be used for both element-wise and row/column-wise operations.

In [107]:
df=pd.DataFrame({'A':[1.2,3.4,5.6],
                 'B':[7.8,9.1,2.3]})
df_1=df.applymap(np.int64)
print(df_1)
df_2=df.apply(lambda row:row.mean(),axis=0)
print(df_2)

   A  B
0  1  7
1  3  9
2  5  2
A    3.4
B    6.4
dtype: float64

C:\Users\sharath R\AppData\Local\Temp\ipykernel_25788\2512383952.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_1=df.applymap(np.int64)


l) Reindex Function

The reindex function in Pandas is used to change the row labels and/or column labels of a DataFrame. This function can be used to align data from multiple DataFrames or to update the labels based on new data. The function takes in a list or an array of new labels as its first argument and, optionally, a fill value to replace any missing values. The reindexing can be done along either the row axis (0) or the column axis (1). The reindexed DataFrame is returned.

In [109]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
print(df)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [111]:
print(df.reindex([1,0,3,2]))

   one  two  three  four
1    2   20    200  2000
0    1   10    100  1000
3    4   40    400  4000
2    3   30    300  3000

In [112]:
data = {'Name' : ['John', 'Jane', 'Jim', 'Joan'],
        'Age'  : [25, 30, 35, 40],
        'City' : ['New York', 'Los Angeles', 'Chicago', 'Houston']}

df = pd.DataFrame(data)

In [114]:
df.reindex(columns=['Name','City','Age'])

   Name         City  Age
0  John     New York   25
1  Jane  Los Angeles   30
2   Jim      Chicago   35
3  Joan      Houston   40

m) Renaming Columns in Pandas DataFrame

The rename function in Pandas is used to change the row labels and/or column labels of a DataFrame. It can be used to update the names of one or multiple rows or columns by passing a dictionary of new names as its argument. The dictionary should have the old names as keys and the new names as values

In [126]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df.rename(columns = {'one' : 'One','two': 'Two', 'three' : 'Three', 'four' : 'Four'}, 
           inplace = True, index = {0:'a',1:'b',2:'c',4:'d'})
df

   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
3    4   40    400  4000

In [121]:
df

n) Sorting in Pandas DataFrame

Pandas provides several methods to sort a DataFrame based on one or more columns.

sort_values: This method sorts the DataFrame based on one or more columns. The default sorting order is ascending, but you can change it to descending by passing the ascending argument with a value of False. bash

In [127]:
data = { 'one'   : pd.Series([11, 51, 31, 41]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 500, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0   11   10    100  1000
1   51   20    200  2000
2   31   30    500  3000
3   41   40    400  4000

In [128]:
df.sort_values(by='one')

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

In [129]:
#sort specific order

In [132]:
df.sort_values(by='one',ascending=False)

   one  two  three  four
1   51   20    200  2000
3   41   40    400  4000
2   31   30    500  3000
0   11   10    100  1000

In [134]:
df.sort_values(by=['one','three'])

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

In [136]:
df.sort_values(by=['one'],kind='heapsort')

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000


o) Groupby Functions

The groupby function in pandas is used to split a dataframe into groups based on one or more columns. It returns a DataFrameGroupBy object, which is similar to a DataFrame but has some additional methods to perform operations on the grouped data.

In [137]:

cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [138]:
df.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [142]:
df.groupby(['Team','Year']).get_group(('Australia',2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

In [143]:
#if data is not getting you definately getting error

In [147]:
df.groupby('Team')['Points'].sum()

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

In [151]:
groups=df.groupby('Team')
groups['Points'].agg([np.sum,np.mean,np.median,np.max,np.min])

C:\Users\sharath R\AppData\Local\Temp\ipykernel_25788\1958344755.py:2: FutureWarning: The provided callable <function sum at 0x000001F3EAF5C680> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  groups['Points'].agg([np.sum,np.mean,np.median,np.max,np.min])
C:\Users\sharath R\AppData\Local\Temp\ipykernel_25788\1958344755.py:2: FutureWarning: The provided callable <function mean at 0x000001F3EAF5D760> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  groups['Points'].agg([np.sum,np.mean,np.median,np.max,np.min])
C:\Users\sharath R\AppData\Local\Temp\ipykernel_25788\1958344755.py:2: FutureWarning: The provided callable <function median at 0x000001F3EB08C9A0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  groups['Points'].agg([np.sum,np.mean,np.median,np.max,np.min])
C:\Users\sharath R\AppData\Local\Temp\ipykernel_25788\1958344755.py:2: FutureWarning: The provided callable <function max at 0x000001F3EAF5CD60> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  groups['Points'].agg([np.sum,np.mean,np.median,np.max,np.min])
C:\Users\sharath R\AppData\Local\Temp\ipykernel_25788\1958344755.py:2: FutureWarning: The provided callable <function min at 0x000001F3EAF5CEA0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  groups['Points'].agg([np.sum,np.mean,np.median,np.max,np.min])

            sum        mean  median  max  min
Team
Australia  1706  853.000000   853.0  891  815
India      2459  819.666667   801.0  876  782
NZ         2332  777.333333   758.0  883  691
SA         3218  804.500000   804.0  834  776

In [153]:
#filter Function :- using lamda function

In [154]:
df.groupby('Team').filter(lambda x:len(x)==4)

  Team  Rank  Year  Points
4   SA     3  2014     776
5   SA     4  2015     784
6   SA     1  2016     834
7   SA     1  2017     824

In [155]:
df.groupby('Team').filter(lambda x: len(x)==3)

     Team  Rank  Year  Points
0   India     2  2014     876
1   India     3  2015     801
8      NZ     2  2016     758
9      NZ     4  2014     691
10     NZ     1  2015     883
11  India     2  2017     782

__
3. Working with csv files and basic data Analysis Using Panda__s